public/benchmarks/20260228_023311/run_variant_b_20260228_023311.txt
/opt/homebrew/bin/java  -classpath /Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/conf:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/HdrHistogram-2.1.12.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/bsh-2.0b4.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/core-0.18.0-shivam-SNAPSHOT.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/htrace-core4-4.1.0-incubating.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/jackson-core-asl-1.9.4.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/jackson-mapper-asl-1.9.4.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/jcommander-1.12.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/junit-3.8.1.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/snakeyaml-1.6.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/testng-6.1.1.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-accessanalyzer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-acm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-acmpca-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-alexaforbusiness-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-amplify-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-api-gateway-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-apigatewaymanagementapi-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-apigatewayv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-appconfig-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-applicationautoscaling-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-applicationinsights-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-appmesh-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-appstream-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-appsync-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-athena-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-augmentedairuntime-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-autoscaling-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-autoscalingplans-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-backup-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-batch-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-budgets-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-chime-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloud9-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-clouddirectory-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudformation-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudfront-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudhsm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudhsmv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudsearch-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudtrail-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudwatch-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudwatchmetrics-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codeartifact-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codebuild-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codecommit-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codedeploy-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codeguruprofiler-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codegurureviewer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codepipeline-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codestar-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codestarconnections-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codestarnotifications-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cognitoidentity-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cognitoidp-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cognitosync-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-comprehend-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-comprehendmedical-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-computeoptimizer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-config-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-connect-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-connectparticipant-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-core-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-costandusagereport-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-costexplorer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-dataexchange-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-datapipeline-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-datasync-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-dax-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-detective-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-devicefarm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-directconnect-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-directory-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-discovery-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-dlm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-dms-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-docdb-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-dynamodb-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ebs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ec2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ec2instanceconnect-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ecr-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ecs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-efs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-eks-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-elasticache-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-elasticbeanstalk-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-elasticinference-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-elasticloadbalancing-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-elasticloadbalancingv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-elasticsearch-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-elastictranscoder-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-emr-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-eventbridge-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-events-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-fms-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-forecast-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-forecastquery-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-frauddetector-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-fsx-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-gamelift-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-glacier-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-globalaccelerator-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-glue-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-greengrass-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-groundstation-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-guardduty-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-health-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-honeycode-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iam-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-imagebuilder-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-importexport-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-inspector-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iot-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iot1clickdevices-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iot1clickprojects-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iotanalytics-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iotevents-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ioteventsdata-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iotjobsdataplane-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iotsecuretunneling-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iotsitewise-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iotthingsgraph-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-kafka-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-kendra-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-kinesis-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-kinesisanalyticsv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-kinesisvideo-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-kinesisvideosignalingchannels-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-kms-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-lakeformation-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-lambda-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-lex-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-lexmodelbuilding-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-licensemanager-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-lightsail-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-logs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-machinelearning-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-macie-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-macie2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-managedblockchain-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-marketplacecatalog-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-marketplacecommerceanalytics-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-marketplaceentitlement-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-marketplacemeteringservice-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mechanicalturkrequester-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mediaconnect-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mediaconvert-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-medialive-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mediapackage-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mediapackagevod-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mediastore-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mediastoredata-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mediatailor-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-migrationhub-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-migrationhubconfig-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mobile-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-models-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mq-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-neptune-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-networkmanager-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-opsworks-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-opsworkscm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-organizations-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-outposts-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-personalize-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-personalizeevents-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-personalizeruntime-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-pi-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-pinpoint-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-pinpointemail-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-pinpointsmsvoice-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-polly-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-pricing-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-qldb-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-qldbsession-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-quicksight-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ram-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-rds-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-rdsdata-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-redshift-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-rekognition-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-resourcegroups-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-resourcegroupstaggingapi-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-robomaker-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-route53-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-route53resolver-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-s3-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-s3control-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-sagemaker-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-sagemakerruntime-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-savingsplans-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-schemas-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-secretsmanager-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-securityhub-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-serverlessapplicationrepository-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-servermigration-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-servicecatalog-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-servicediscovery-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-servicequotas-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ses-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-sesv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-shield-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-signer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-simpledb-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-simpleworkflow-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-snowball-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-sns-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-sqs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ssm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-sso-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ssooidc-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-stepfunctions-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-storagegateway-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-sts-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-support-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-swf-libraries-1.11.22.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-synthetics-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-textract-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-transcribe-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-transfer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-translate-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-waf-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-wafv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-workdocs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-worklink-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-workmail-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-workmailmessageflow-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-workspaces-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-xray-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/commons-codec-1.11.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/commons-logging-1.1.3.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/dynamodb-binding-0.18.0-shivam-SNAPSHOT.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/httpclient-4.5.9.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/httpcore-4.4.11.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/ion-java-1.0.2.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/jackson-annotations-2.6.0.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/jackson-core-2.6.7.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/jackson-databind-2.6.7.3.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/jackson-dataformat-cbor-2.6.7.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/jmespath-java-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/joda-time-2.8.1.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/log4j-1.2.17.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/netty-buffer-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/netty-codec-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/netty-codec-http-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/netty-common-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/netty-handler-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/netty-resolver-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/netty-transport-4.1.44.Final.jar site.ycsb.Client -t -db site.ycsb.db.DynamoDBClient -P ./workloads/variant_b -p dynamodb.endpoint=http://localhost:8787/api -p dynamodb.primaryKey=PK -p dynamodb.primaryKeyType=HASH -p dynamodb.awsCredentialsFile=fake-aws-credentials.properties -s
Command line: -t -db site.ycsb.db.DynamoDBClient -P ./workloads/variant_b -p dynamodb.endpoint=http://localhost:8787/api -p dynamodb.primaryKey=PK -p dynamodb.primaryKeyType=HASH -p dynamodb.awsCredentialsFile=fake-aws-credentials.properties -s
YCSB Client 0.18.0-shivam-SNAPSHOT

Loading workload...
Starting test.
2026-02-28 02:35:22:519 0 sec: 0 operations; est completion in 0 second 
0    [Thread-6] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
0    [Thread-4] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
0    [Thread-7] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
0    [Thread-5] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
0    [Thread-2] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
0    [Thread-3] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
2026-02-28 02:35:32:494 10 sec: 3916 operations; 391.37 current ops/sec; est completion in 3 minutes [READ: Count=2326, Max=146559, Min=2538, Avg=13703.5, 50=9615, 90=21583, 99=91007, 99.9=130943, 99.99=146559] [INSERT: Count=581, Max=130431, Min=3016, Avg=15704.85, 50=10791, 90=26735, 99=109183, 99.9=130431, 99.99=130431] [UPDATE: Count=1009, Max=146815, Min=3204, Avg=15244.19, 50=10999, 90=27247, 99=78271, 99.9=123647, 99.99=146815] 
2026-02-28 02:35:42:490 20 sec: 7457 operations; 354.24 current ops/sec; est completion in 3 minutes [READ: Count=2126, Max=269311, Min=2332, Avg=16000.69, 50=11743, 90=27839, 99=75391, 99.9=107647, 99.99=269311] [INSERT: Count=539, Max=269311, Min=3706, Avg=18200.83, 50=13823, 90=31311, 99=79871, 99.9=269311, 99.99=269311] [UPDATE: Count=876, Max=270847, Min=2658, Avg=19262.6, 50=13927, 90=37375, 99=87167, 99.9=270847, 99.99=270847] 
2026-02-28 02:35:52:490 30 sec: 11474 operations; 401.66 current ops/sec; est completion in 3 minutes [READ: Count=2406, Max=121407, Min=2654, Avg=14331.02, 50=10671, 90=23519, 99=63135, 99.9=119039, 99.99=121407] [INSERT: Count=627, Max=119871, Min=3774, Avg=16760.17, 50=12663, 90=30303, 99=76415, 99.9=119871, 99.99=119871] [UPDATE: Count=984, Max=119295, Min=3248, Avg=15366.54, 50=11959, 90=26303, 99=63167, 99.9=119295, 99.99=119295] 
2026-02-28 02:36:02:490 40 sec: 16030 operations; 455.74 current ops/sec; est completion in 2 minutes [READ: Count=2760, Max=199295, Min=2082, Avg=12459.34, 50=9071, 90=19263, 99=64703, 99.9=165375, 99.99=199295] [INSERT: Count=691, Max=199295, Min=2706, Avg=14085.36, 50=10455, 90=20543, 99=74047, 99.9=199295, 99.99=199295] [UPDATE: Count=1105, Max=166015, Min=2716, Avg=14324.64, 50=10663, 90=23919, 99=59679, 99.9=161663, 99.99=166015] 
2026-02-28 02:36:12:494 50 sec: 20424 operations; 439.18 current ops/sec; est completion in 2 minutes [READ: Count=2606, Max=139519, Min=2019, Avg=12975.69, 50=9543, 90=21151, 99=61919, 99.9=130495, 99.99=139519] [INSERT: Count=689, Max=147199, Min=3258, Avg=15258.63, 50=11095, 90=27071, 99=68287, 99.9=147199, 99.99=147199] [UPDATE: Count=1099, Max=146431, Min=2724, Avg=14186.66, 50=10847, 90=23887, 99=56351, 99.9=109055, 99.99=146431] 
2026-02-28 02:36:22:489 60 sec: 24300 operations; 387.79 current ops/sec; est completion in 2 minutes [READ: Count=2371, Max=151935, Min=2278, Avg=14937.63, 50=10367, 90=31055, 99=66879, 99.9=148607, 99.99=151935] [INSERT: Count=569, Max=204415, Min=3034, Avg=17358.52, 50=11759, 90=35871, 99=77247, 99.9=204415, 99.99=204415] [UPDATE: Count=936, Max=152191, Min=2612, Avg=15675.14, 50=11287, 90=32799, 99=61855, 99.9=152191, 99.99=152191] 
2026-02-28 02:36:32:488 70 sec: 26753 operations; 245.3 current ops/sec; est completion in 2 minutes [READ: Count=1461, Max=185087, Min=3822, Avg=22947.83, 50=15855, 90=41151, 99=149375, 99.9=184959, 99.99=185087] [INSERT: Count=369, Max=190591, Min=4010, Avg=28416.97, 50=20111, 90=56863, 99=149503, 99.9=190591, 99.99=190591] [UPDATE: Count=624, Max=181887, Min=2764, Avg=25531.5, 50=17567, 90=48319, 99=138623, 99.9=181887, 99.99=181887] 
2026-02-28 02:36:42:492 80 sec: 30094 operations; 333.97 current ops/sec; est completion in 2 minutes [READ: Count=2001, Max=276991, Min=2162, Avg=16960.46, 50=12039, 90=31583, 99=78271, 99.9=236671, 99.99=276991] [INSERT: Count=480, Max=236543, Min=3332, Avg=19528.92, 50=13671, 90=36223, 99=100031, 99.9=236543, 99.99=236543] [UPDATE: Count=859, Max=210815, Min=2824, Avg=19354.18, 50=13727, 90=34559, 99=103679, 99.9=210815, 99.99=210815] 
2026-02-28 02:36:52:488 90 sec: 34984 operations; 489.2 current ops/sec; est completion in 1 minute [READ: Count=2896, Max=81599, Min=2290, Avg=11720.36, 50=9271, 90=18495, 99=44991, 99.9=81087, 99.99=81599] [INSERT: Count=695, Max=54783, Min=2636, Avg=12935.59, 50=11071, 90=19967, 99=45311, 99.9=54783, 99.99=54783] [UPDATE: Count=1300, Max=81599, Min=2506, Avg=13078.56, 50=10703, 90=20127, 99=46335, 99.9=81279, 99.99=81599] 
2026-02-28 02:37:02:488 100 sec: 37171 operations; 218.7 current ops/sec; est completion in 1 minute [READ: Count=1302, Max=251391, Min=2728, Avg=26123.7, 50=17711, 90=50143, 99=148607, 99.9=242559, 99.99=251391] [INSERT: Count=328, Max=201215, Min=4132, Avg=28851.79, 50=18719, 90=56639, 99=167039, 99.9=201215, 99.99=201215] [UPDATE: Count=556, Max=255487, Min=5124, Avg=29631.95, 50=20063, 90=56351, 99=172415, 99.9=255487, 99.99=255487] 
2026-02-28 02:37:12:491 110 sec: 40723 operations; 355.16 current ops/sec; est completion in 1 minute [READ: Count=2133, Max=206591, Min=2302, Avg=16114.54, 50=11775, 90=26799, 99=92671, 99.9=205951, 99.99=206591] [INSERT: Count=537, Max=206079, Min=3442, Avg=18121.29, 50=13943, 90=29103, 99=101503, 99.9=206079, 99.99=206079] [UPDATE: Count=886, Max=158975, Min=2612, Avg=17923.36, 50=13559, 90=28351, 99=88831, 99.9=158975, 99.99=158975] 
2026-02-28 02:37:22:488 120 sec: 44791 operations; 406.84 current ops/sec; est completion in 1 minute [READ: Count=2471, Max=148351, Min=2280, Avg=14210.01, 50=11087, 90=23359, 99=56127, 99.9=139775, 99.99=148351] [INSERT: Count=606, Max=148991, Min=2920, Avg=15132.46, 50=12887, 90=23295, 99=44543, 99.9=148991, 99.99=148991] [UPDATE: Count=987, Max=148863, Min=3508, Avg=15853.02, 50=13023, 90=24815, 99=54143, 99.9=148863, 99.99=148863] 
2026-02-28 02:37:32:493 130 sec: 48816 operations; 402.34 current ops/sec; est completion in 1 minute [READ: Count=2385, Max=117119, Min=2312, Avg=13788.58, 50=10775, 90=22431, 99=58815, 99.9=113215, 99.99=117119] [INSERT: Count=597, Max=134527, Min=3744, Avg=16286.83, 50=12655, 90=25887, 99=116159, 99.9=134527, 99.99=134527] [UPDATE: Count=1043, Max=134399, Min=2830, Avg=16632.98, 50=12527, 90=27743, 99=96127, 99.9=115519, 99.99=134399] 
2026-02-28 02:37:42:492 140 sec: 52340 operations; 352.47 current ops/sec; est completion in 1 minute [READ: Count=2126, Max=366591, Min=2446, Avg=16389.2, 50=11623, 90=26927, 99=68095, 99.9=366335, 99.99=366591] [INSERT: Count=529, Max=361727, Min=2722, Avg=18375.36, 50=14055, 90=31951, 99=67327, 99.9=361727, 99.99=361727] [UPDATE: Count=870, Max=362751, Min=2748, Avg=17705.78, 50=13183, 90=29231, 99=94847, 99.9=362751, 99.99=362751] 
2026-02-28 02:37:52:495 150 sec: 56645 operations; 430.41 current ops/sec; est completion in 1 minute [READ: Count=2573, Max=147839, Min=2120, Avg=13146.53, 50=9831, 90=20927, 99=65727, 99.9=144639, 99.99=147839] [INSERT: Count=631, Max=143743, Min=3128, Avg=15107.62, 50=11735, 90=24127, 99=75199, 99.9=143743, 99.99=143743] [UPDATE: Count=1103, Max=147711, Min=2480, Avg=15023.34, 50=11287, 90=26607, 99=67583, 99.9=147327, 99.99=147711] 
2026-02-28 02:38:02:492 160 sec: 60755 operations; 411 current ops/sec; est completion in 51 seconds [READ: Count=2429, Max=126143, Min=2692, Avg=13836.57, 50=10351, 90=23503, 99=63775, 99.9=119615, 99.99=126143] [INSERT: Count=597, Max=119999, Min=2992, Avg=15827.04, 50=12079, 90=28191, 99=64927, 99.9=119999, 99.99=119999] [UPDATE: Count=1081, Max=136831, Min=2496, Avg=15666.35, 50=12119, 90=27215, 99=65055, 99.9=135167, 99.99=136831] 
2026-02-28 02:38:12:491 170 sec: 64622 operations; 386.74 current ops/sec; est completion in 41 seconds [READ: Count=2296, Max=132095, Min=2424, Avg=14695.39, 50=10959, 90=24399, 99=68991, 99.9=106815, 99.99=132095] [INSERT: Count=615, Max=101567, Min=3036, Avg=16260.6, 50=12447, 90=27695, 99=71807, 99.9=101567, 99.99=101567] [UPDATE: Count=956, Max=132479, Min=3090, Avg=16989.87, 50=12639, 90=31999, 99=72831, 99.9=132479, 99.99=132479] 
2026-02-28 02:38:22:491 180 sec: 68145 operations; 352.34 current ops/sec; est completion in 32 seconds [READ: Count=2076, Max=368639, Min=2780, Avg=15538.33, 50=11551, 90=26959, 99=78271, 99.9=220671, 99.99=368639] [INSERT: Count=523, Max=368127, Min=3662, Avg=18752.03, 50=12535, 90=30143, 99=98367, 99.9=368127, 99.99=368127] [UPDATE: Count=924, Max=377087, Min=2814, Avg=19327.75, 50=12631, 90=32031, 99=174079, 99.9=377087, 99.99=377087] 
2026-02-28 02:38:32:491 190 sec: 71988 operations; 384.26 current ops/sec; est completion in 22 seconds [READ: Count=2329, Max=568319, Min=2464, Avg=15030.96, 50=10447, 90=24991, 99=73535, 99.9=528383, 99.99=568319] [INSERT: Count=541, Max=133247, Min=3140, Avg=15642.15, 50=12271, 90=25359, 99=79935, 99.9=133247, 99.99=133247] [UPDATE: Count=975, Max=568831, Min=2910, Avg=16953.04, 50=11999, 90=31199, 99=66111, 99.9=568831, 99.99=568831] 
2026-02-28 02:38:42:521 200 sec: 75887 operations; 389.16 current ops/sec; est completion in 11 seconds [READ: Count=2313, Max=166271, Min=2260, Avg=14340.55, 50=10831, 90=21839, 99=67391, 99.9=162303, 99.99=166271] [INSERT: Count=583, Max=169215, Min=2874, Avg=16652.37, 50=12279, 90=28303, 99=87359, 99.9=169215, 99.99=169215] [UPDATE: Count=1001, Max=162687, Min=3038, Avg=16449.46, 50=12031, 90=25679, 99=91263, 99.9=160895, 99.99=162687] 
2026-02-28 02:38:52:489 210 sec: 79982 operations; 410.36 current ops/sec; est completion in 1 second [READ: Count=2497, Max=286463, Min=1834, Avg=13188.46, 50=10111, 90=18831, 99=62591, 99.9=282111, 99.99=286463] [CLEANUP: Count=4, Max=4, Min=1, Avg=1.75, 50=1, 90=4, 99=4, 99.9=4, 99.99=4] [INSERT: Count=634, Max=285439, Min=3004, Avg=15437.54, 50=11559, 90=24319, 99=69375, 99.9=285439, 99.99=285439] [UPDATE: Count=964, Max=285951, Min=2850, Avg=16428.93, 50=11343, 90=24719, 99=133247, 99.9=285951, 99.99=285951] 
2026-02-28 02:38:52:609 210 sec: 80000 operations; 148.76 current ops/sec; [READ: Count=10, Max=28303, Min=3578, Avg=9272.7, 50=5719, 90=16087, 99=28303, 99.9=28303, 99.99=28303] [CLEANUP: Count=2, Max=1, Min=0, Avg=0.5, 50=0, 90=1, 99=1, 99.9=1, 99.99=1] [INSERT: Count=3, Max=5519, Min=2704, Avg=4275, 50=4603, 90=5519, 99=5519, 99.9=5519, 99.99=5519] [UPDATE: Count=5, Max=9111, Min=4868, Avg=6452, 50=6331, 90=9111, 99=9111, 99.9=9111, 99.99=9111] 
[OVERALL], RunTime(ms), 210122
[OVERALL], Throughput(ops/sec), 380.73119425857357
[TOTAL_GCS_G1_Young_Generation], Count, 26
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 225
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.10708064838522383
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 26
[TOTAL_GC_TIME], Time(ms), 225
[TOTAL_GC_TIME_%], Time(%), 0.10708064838522383
[READ], Operations, 47893
[READ], AverageLatency(us), 14851.032113252459
[READ], MinLatency(us), 1834
[READ], MaxLatency(us), 568319
[READ], 50thPercentileLatency(us), 10663
[READ], 90thPercentileLatency(us), 25759
[READ], 95thPercentileLatency(us), 38175
[READ], 99thPercentileLatency(us), 73279
[READ], 99.9PercentileLatency(us), 177407
[READ], Return=OK, 47893
[CLEANUP], Operations, 6
[CLEANUP], AverageLatency(us), 1.3333333333333333
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 4
[CLEANUP], 50thPercentileLatency(us), 1
[CLEANUP], 90thPercentileLatency(us), 4
[CLEANUP], 95thPercentileLatency(us), 4
[CLEANUP], 99thPercentileLatency(us), 4
[CLEANUP], 99.9PercentileLatency(us), 4
[INSERT], Operations, 11964
[INSERT], AverageLatency(us), 16966.343530591774
[INSERT], MinLatency(us), 2636
[INSERT], MaxLatency(us), 368127
[INSERT], 50thPercentileLatency(us), 12359
[INSERT], 90thPercentileLatency(us), 29887
[INSERT], 95thPercentileLatency(us), 42911
[INSERT], 99thPercentileLatency(us), 87359
[INSERT], 99.9PercentileLatency(us), 201215
[INSERT], Return=OK, 11964
[UPDATE], Operations, 20143
[UPDATE], AverageLatency(us), 16891.90547584769
[UPDATE], MinLatency(us), 2480
[UPDATE], MaxLatency(us), 568831
[UPDATE], 50thPercentileLatency(us), 12207
[UPDATE], 90thPercentileLatency(us), 29727
[UPDATE], 95thPercentileLatency(us), 42495
[UPDATE], 99thPercentileLatency(us), 83647
[UPDATE], 99.9PercentileLatency(us), 207999
[UPDATE], Return=OK, 20143